; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v1 ?v7)
             (pred_8 ?v8 ?v13)
             (pred_7 ?v1 ?v13)
             (pred_5 ?v12 ?v1 )
	     (pred_2 ?v1)
             (pred_6 ?v6)
             (pred_11 ?v8)
             (pred_10 ?v13)
             (pred_4 ?v1)
             (pred_9 ?v8)
             (pred_1 ?v1)
             (pred_3 ))



(:action op_5
:parameters (?v3 ?v2 ?v10 ?v5)
:precondition (and (pred_6 ?v3) (pred_6 ?v2) (pred_11 ?v10) (pred_10 ?v5)
          (pred_12 ?v3 ?v2) (pred_8 ?v10 ?v5)
                   (pred_7 ?v2 ?v5) (pred_2 ?v3) 
                   (pred_4 ?v2) (pred_9 ?v10))
:effect (and  (pred_1 ?v2) (not (pred_4 ?v2))))


(:action op_2
:parameters (?v3 ?v4)
:precondition (and (pred_6 ?v3) (pred_6 ?v4)
               (pred_2 ?v3) (pred_12 ?v3 ?v4) (pred_1 ?v4))
:effect (and (pred_2 ?v4) (not (pred_2 ?v3))))

(:action op_3
:parameters (?v3 ?v10)
:precondition (and (pred_6 ?v3) (pred_11 ?v10) 
                  (pred_2 ?v3) (pred_5 ?v10 ?v3) (pred_3 ))
:effect (and (pred_9 ?v10)
   (not (pred_5 ?v10 ?v3)) (not (pred_3 ))))


(:action op_4
:parameters (?v3 ?v9 ?v11)
:precondition (and (pred_6 ?v3) (pred_11 ?v9) (pred_11 ?v11)
                  (pred_2 ?v3) (pred_9 ?v11) (pred_5 ?v9 ?v3))
:effect (and (pred_9 ?v9) (pred_5 ?v11 ?v3)
        (not (pred_9 ?v11)) (not (pred_5 ?v9 ?v3))))

(:action op_1
:parameters (?v3 ?v10)
:precondition (and (pred_6 ?v3) (pred_11 ?v10) 
                  (pred_2 ?v3) (pred_9 ?v10))
:effect (and (pred_3 ) (pred_5 ?v10 ?v3) (not (pred_9 ?v10)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_09 obj_11 obj_06 obj_02 obj_25 obj_15 obj_03 obj_27 obj_29 obj_12 obj_05 obj_26 obj_21 obj_22 obj_13 obj_28 obj_20 obj_19 obj_14 obj_23 obj_01 obj_04 obj_17 obj_10 obj_30
    obj_24 obj_18
    obj_16 obj_07 obj_08
    )

    (:init
       (pred_3)

       (pred_6 obj_09)
       (pred_6 obj_11)
       (pred_6 obj_06)
       (pred_6 obj_02)
       (pred_6 obj_25)
       (pred_6 obj_15)
       (pred_6 obj_03)
       (pred_6 obj_27)
       (pred_6 obj_29)
       (pred_6 obj_12)
       (pred_6 obj_05)
       (pred_6 obj_26)
       (pred_6 obj_21)
       (pred_6 obj_22)
       (pred_6 obj_13)
       (pred_6 obj_28)
       (pred_6 obj_20)
       (pred_6 obj_19)
       (pred_6 obj_14)
       (pred_6 obj_23)
       (pred_6 obj_01)
       (pred_6 obj_04)
       (pred_6 obj_17)
       (pred_6 obj_10)
       (pred_6 obj_30)
       (pred_10 obj_24)
       (pred_10 obj_18)
       (pred_11 obj_16)
       (pred_11 obj_07)
       (pred_11 obj_08)

       (pred_12 obj_09 obj_15)
       (pred_12 obj_09 obj_11)
       (pred_12 obj_11 obj_03)
       (pred_12 obj_11 obj_06)
       (pred_12 obj_11 obj_09)
       (pred_12 obj_06 obj_27)
       (pred_12 obj_06 obj_02)
       (pred_12 obj_06 obj_11)
       (pred_12 obj_02 obj_29)
       (pred_12 obj_02 obj_25)
       (pred_12 obj_02 obj_06)
       (pred_12 obj_25 obj_12)
       (pred_12 obj_25 obj_02)
       (pred_12 obj_15 obj_05)
       (pred_12 obj_15 obj_03)
       (pred_12 obj_15 obj_09)
       (pred_12 obj_03 obj_26)
       (pred_12 obj_03 obj_27)
       (pred_12 obj_03 obj_11)
       (pred_12 obj_03 obj_15)
       (pred_12 obj_27 obj_21)
       (pred_12 obj_27 obj_29)
       (pred_12 obj_27 obj_06)
       (pred_12 obj_27 obj_03)
       (pred_12 obj_29 obj_22)
       (pred_12 obj_29 obj_12)
       (pred_12 obj_29 obj_02)
       (pred_12 obj_29 obj_27)
       (pred_12 obj_12 obj_13)
       (pred_12 obj_12 obj_25)
       (pred_12 obj_12 obj_29)
       (pred_12 obj_05 obj_28)
       (pred_12 obj_05 obj_26)
       (pred_12 obj_05 obj_15)
       (pred_12 obj_26 obj_20)
       (pred_12 obj_26 obj_21)
       (pred_12 obj_26 obj_03)
       (pred_12 obj_26 obj_05)
       (pred_12 obj_21 obj_19)
       (pred_12 obj_21 obj_22)
       (pred_12 obj_21 obj_27)
       (pred_12 obj_21 obj_26)
       (pred_12 obj_22 obj_14)
       (pred_12 obj_22 obj_13)
       (pred_12 obj_22 obj_29)
       (pred_12 obj_22 obj_21)
       (pred_12 obj_13 obj_23)
       (pred_12 obj_13 obj_12)
       (pred_12 obj_13 obj_22)
       (pred_12 obj_28 obj_01)
       (pred_12 obj_28 obj_20)
       (pred_12 obj_28 obj_05)
       (pred_12 obj_20 obj_04)
       (pred_12 obj_20 obj_19)
       (pred_12 obj_20 obj_26)
       (pred_12 obj_20 obj_28)
       (pred_12 obj_19 obj_17)
       (pred_12 obj_19 obj_14)
       (pred_12 obj_19 obj_21)
       (pred_12 obj_19 obj_20)
       (pred_12 obj_14 obj_10)
       (pred_12 obj_14 obj_23)
       (pred_12 obj_14 obj_22)
       (pred_12 obj_14 obj_19)
       (pred_12 obj_23 obj_30)
       (pred_12 obj_23 obj_13)
       (pred_12 obj_23 obj_14)
       (pred_12 obj_01 obj_04)
       (pred_12 obj_01 obj_28)
       (pred_12 obj_04 obj_17)
       (pred_12 obj_04 obj_20)
       (pred_12 obj_04 obj_01)
       (pred_12 obj_17 obj_10)
       (pred_12 obj_17 obj_19)
       (pred_12 obj_17 obj_04)
       (pred_12 obj_10 obj_30)
       (pred_12 obj_10 obj_14)
       (pred_12 obj_10 obj_17)
       (pred_12 obj_30 obj_23)
       (pred_12 obj_30 obj_10)
       (pred_4 obj_10)
       (pred_4 obj_23)
       (pred_4 obj_11)
       (pred_7  obj_10 obj_24)
       (pred_7  obj_23 obj_18)
       (pred_7  obj_11 obj_18)
       (pred_1 obj_09)
       (pred_1 obj_06)
       (pred_1 obj_02)
       (pred_1 obj_25)
       (pred_1 obj_15)
       (pred_1 obj_03)
       (pred_1 obj_27)
       (pred_1 obj_29)
       (pred_1 obj_12)
       (pred_1 obj_05)
       (pred_1 obj_26)
       (pred_1 obj_21)
       (pred_1 obj_22)
       (pred_1 obj_13)
       (pred_1 obj_28)
       (pred_1 obj_20)
       (pred_1 obj_19)
       (pred_1 obj_14)
       (pred_1 obj_01)
       (pred_1 obj_04)
       (pred_1 obj_17)
       (pred_1 obj_30)

       (pred_8  obj_16 obj_24)
       (pred_8  obj_07 obj_18)
       (pred_8  obj_08 obj_24)
       (pred_5 obj_16 obj_05)
       (pred_5 obj_07 obj_12)
       (pred_5 obj_08 obj_23)
       (pred_2 obj_01)
    )

    (:goal (and
       (pred_5 obj_07 obj_03)
    ))
(:constraints
  (always (not (pred_2 obj_29)))
)
)

; plan
1. (op_2 obj_01 obj_28)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_28)
   goals met: 0 of 1
2. (op_2 obj_28 obj_05)
   deleted: (pred_2 obj_28)
   added: (pred_2 obj_05)
   goals met: 0 of 1
3. (op_3 obj_05 obj_16)
   deleted: (pred_5 obj_16 obj_05) (pred_3)
   added: (pred_9 obj_16)
   goals met: 0 of 1
4. (op_2 obj_05 obj_15)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_15)
   goals met: 0 of 1
5. (op_2 obj_15 obj_03)
   deleted: (pred_2 obj_15)
   added: (pred_2 obj_03)
   goals met: 0 of 1
6. (op_1 obj_03 obj_16)
   deleted: (pred_9 obj_16)
   added: (pred_3) (pred_5 obj_16 obj_03)
   goals met: 0 of 1
7. (op_2 obj_03 obj_27)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_27)
   goals met: 0 of 1
8. (op_2 obj_27 obj_21)
   deleted: (pred_2 obj_27)
   added: (pred_2 obj_21)
   goals met: 0 of 1
9. (op_2 obj_21 obj_22)
   deleted: (pred_2 obj_21)
   added: (pred_2 obj_22)
   goals met: 0 of 1
10. (op_2 obj_22 obj_13)
   deleted: (pred_2 obj_22)
   added: (pred_2 obj_13)
   goals met: 0 of 1
11. (op_2 obj_13 obj_12)
   deleted: (pred_2 obj_13)
   added: (pred_2 obj_12)
   goals met: 0 of 1
12. (op_3 obj_12 obj_07)
   deleted: (pred_5 obj_07 obj_12) (pred_3)
   added: (pred_9 obj_07)
   goals met: 0 of 1
13. (op_2 obj_12 obj_25)
   deleted: (pred_2 obj_12)
   added: (pred_2 obj_25)
   goals met: 0 of 1
14. (op_2 obj_25 obj_02)
   deleted: (pred_2 obj_25)
   added: (pred_2 obj_02)
   goals met: 0 of 1
15. (op_2 obj_02 obj_06)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_06)
   goals met: 0 of 1
16. (op_2 obj_06 obj_27)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_27)
   goals met: 0 of 1
17. (op_2 obj_27 obj_03)
   deleted: (pred_2 obj_27)
   added: (pred_2 obj_03)
   goals met: 0 of 1
18. (op_4 obj_03 obj_16 obj_07)
   deleted: (pred_9 obj_07) (pred_5 obj_16 obj_03)
   added: (pred_9 obj_16) (pred_5 obj_07 obj_03)
   goals met: 1 of 1
